; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_3 ?v2)
               (pred_1 ?v2)
               (pred_2)
               (pred_4 ?v2)
               (pred_5 ?v2 ?v3))

  (:action op_4
    :parameters (?v1)
    :precondition (and (pred_3 ?v1) (pred_1 ?v1) (pred_2))
    :effect (and (pred_4 ?v1) (not (pred_3 ?v1)) (not (pred_1 ?v1)) 
                 (not (pred_2))))

  (:action op_1
    :parameters  (?v1)
    :precondition (pred_4 ?v1)
    :effect (and (pred_3 ?v1) (pred_2) (pred_1 ?v1) 
                 (not (pred_4 ?v1))))

  (:action op_2
    :parameters  (?v1 ?v4)
    :precondition (and (pred_3 ?v4) (pred_4 ?v1))
    :effect (and (pred_2) (pred_3 ?v1) (pred_5 ?v1 ?v4)
                 (not (pred_3 ?v4)) (not (pred_4 ?v1))))

  (:action op_3
    :parameters  (?v1 ?v4)
    :precondition (and (pred_5 ?v1 ?v4) (pred_3 ?v1) (pred_2))
    :effect (and (pred_4 ?v1) (pred_3 ?v4)
                 (not (pred_5 ?v1 ?v4)) (not (pred_3 ?v1)) (not (pred_2)))))

; problem
(define (problem BW-rand-6)
(:domain blocksworld)
(:objects obj_01 obj_06 obj_04 obj_03 obj_02 obj_05 )
(:init
(pred_2)
(pred_1 obj_01)
(pred_5 obj_06 obj_01)
(pred_1 obj_04)
(pred_1 obj_03)
(pred_5 obj_02 obj_03)
(pred_5 obj_05 obj_06)
(pred_3 obj_04)
(pred_3 obj_02)
(pred_3 obj_05)
)
(:goal
(and
(pred_5 obj_01 obj_03)
(pred_5 obj_06 obj_04)
(pred_1 obj_04)
(pred_5 obj_03 obj_06)
(pred_5 obj_02 obj_05)
(pred_1 obj_05))
)

(:constraints
  (sometime-before (pred_5 obj_06 obj_04) (pred_5 obj_01 obj_03))
)
)

; plan
1. (op_3 obj_05 obj_06)
   deleted: (pred_5 obj_05 obj_06) (pred_3 obj_05) (pred_2)
   added: (pred_4 obj_05) (pred_3 obj_06)
   goals met: 1 of 6
2. (op_1 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_3 obj_05) (pred_2) (pred_1 obj_05)
   goals met: 2 of 6
3. (op_3 obj_02 obj_03)
   deleted: (pred_5 obj_02 obj_03) (pred_3 obj_02) (pred_2)
   added: (pred_4 obj_02) (pred_3 obj_03)
   goals met: 2 of 6
4. (op_2 obj_02 obj_05)
   deleted: (pred_3 obj_05) (pred_4 obj_02)
   added: (pred_2) (pred_3 obj_02) (pred_5 obj_02 obj_05)
   goals met: 3 of 6
5. (op_3 obj_06 obj_01)
   deleted: (pred_5 obj_06 obj_01) (pred_3 obj_06) (pred_2)
   added: (pred_4 obj_06) (pred_3 obj_01)
   goals met: 3 of 6
6. (op_1 obj_06)
   deleted: (pred_4 obj_06)
   added: (pred_3 obj_06) (pred_2) (pred_1 obj_06)
   goals met: 3 of 6
7. (op_4 obj_01)
   deleted: (pred_3 obj_01) (pred_1 obj_01) (pred_2)
   added: (pred_4 obj_01)
   goals met: 3 of 6
8. (op_2 obj_01 obj_03)
   deleted: (pred_3 obj_03) (pred_4 obj_01)
   added: (pred_2) (pred_3 obj_01) (pred_5 obj_01 obj_03)
   goals met: 4 of 6
9. (op_4 obj_06)
   deleted: (pred_3 obj_06) (pred_1 obj_06) (pred_2)
   added: (pred_4 obj_06)
   goals met: 4 of 6
10. (op_2 obj_06 obj_04)
   deleted: (pred_3 obj_04) (pred_4 obj_06)
   added: (pred_2) (pred_3 obj_06) (pred_5 obj_06 obj_04)
   goals met: 5 of 6
11. (op_3 obj_01 obj_03)
   deleted: (pred_5 obj_01 obj_03) (pred_3 obj_01) (pred_2)
   added: (pred_4 obj_01) (pred_3 obj_03)
   goals met: 4 of 6
12. (op_1 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_3 obj_01) (pred_2) (pred_1 obj_01)
   goals met: 4 of 6
13. (op_4 obj_03)
   deleted: (pred_3 obj_03) (pred_1 obj_03) (pred_2)
   added: (pred_4 obj_03)
   goals met: 4 of 6
14. (op_2 obj_03 obj_06)
   deleted: (pred_3 obj_06) (pred_4 obj_03)
   added: (pred_2) (pred_3 obj_03) (pred_5 obj_03 obj_06)
   goals met: 5 of 6
15. (op_4 obj_01)
   deleted: (pred_3 obj_01) (pred_1 obj_01) (pred_2)
   added: (pred_4 obj_01)
   goals met: 5 of 6
16. (op_2 obj_01 obj_03)
   deleted: (pred_3 obj_03) (pred_4 obj_01)
   added: (pred_2) (pred_3 obj_01) (pred_5 obj_01 obj_03)
   goals met: 6 of 6
